###############################################################
#  Generated by:      Cadence Innovus 20.14-s095_1
#  OS:                Linux x86_64(Host ID cad28)
#  Generated on:      Fri Oct 10 14:35:26 2025
#  Design:            pe64_lookahead
#  Command:           routeDesign -globalDetail
###############################################################
current_design pe64_lookahead
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
set_wire_load_mode enclosed
set_max_delay 1.2  -from [get_ports {d[63] d[62] d[61] d[60] d[59] d[58] d[57] d[56] d[55] d[54] d[53] d[52] d[51] d[50] d[49] d[48] d[47] d[46] d[45] d[44] d[43] d[42] d[41] d[40] d[39] d[38] d[37] d[36] d[35] d[34] d[33] d[32] d[31] d[30] d[29] d[28] d[27] d[26] d[25] d[24] d[23] d[22] d[21] d[20] d[19] d[18] d[17] d[16] d[15] d[14] d[13] d[12] d[11] d[10] d[9] d[8] d[7] d[6] d[5] d[4] d[3] d[2] d[1] d[0]}]  -to [get_ports {v}] 
